0,combine
1,alpha
2,color
3,moveBy
4,sizeTo
5,getTouchDownTarget
6,getActions
7,notify
8,toBack
9,delete
10,initializeForView
11,onConfigurationChanged
12,setLogLevel
13,newSound
14,pause
15,getDeviceId
16,getPov
17,getJavaHeap
18,gatherControllers
19,onDreamingStarted
20,postRunnable
21,getExternalStoragePath
22,getZipFileHandleIfExists
23,getAssetFileDescriptor
24,isExternalStorageAvailable
25,getNet
26,getRunnables
27,glRenderbufferStorageMultisample
28,glGetFragDataLocation
29,logManagedCachesStatus
30,getPpcY
31,updateOrientation
32,setLooping
33,cancelHttpRequest
34,newClientSocket
35,charAt
36,createDialog
37,setFilters
38,getInteger
39,read
40,update
41,hashCode
42,indexOfValue
43,insert
44,getProgress
45,setTextureFilters
46,dispose
47,BOX
48,QUANTIZED
49,decodeLines
50,getTranslationAtTime
51,getQueuedAssets
52,getAttributeType
53,newObject
54,toMatrix4
55,getName
56,setRightWidth
57,resize
58,getAttributeLocations
59,loc
60,processViewport
61,loadTileLayer
62,touchUp
63,SetType
64,getFont
65,getLayouts
66,translate
67,create
68,quote
69,getFontFile
70,getAndClear
71,getType
72,setBullet
73,setUserData
74,getAngle
75,or
76,keyDown
77,get
78,createWorld
79,getWorldCenter
80,ensureCapacity
81,removeRange
82,newDoubleBuffer
83,keyUp
84,remaining
85,write
86,fling
87,shrink
88,swap
89,lastIndexOf
90,allocateDirect
91,afterGroup
92,toString
93,project
94,getActorWidth
95,getColspan
96,getPadBottomValue
97,getPadLeftValue
98,getSpaceRight
99,padLeft
100,order
101,getMinHeight
102,subSequence
103,put
104,setStyle
105,overlaps
106,set
107,setActorHeight
108,getMethod
109,getMainTexture
110,addSingleResult
111,setRayFromWorld
112,SwigDirector
113,unproject
114,render
115,forName
116,updateContactInfo
117,clipSegmentToLine
118,draw
119,copy
120,rgb565
121,rgba8888ToColor
122,printStackTrace
123,gallopLeft
124,onContactEnded
125,setCacheTime
126,swigTakeOwnership
127,setCollisionFilterGroup
128,background
129,getMinHeightValue
130,minHeight
131,minSize
132,launch
133,resume
134,getManager
135,getVector3
136,computePolygon
137,getCollisionFilterMask
138,setCollisionFilterMask
139,swigReleaseOwnership
140,compareTo
141,reload
142,drawAdjusted
143,generateNormalized
144,getWorldToScreen
145,drawTriangle
146,setDimensions
147,setScaleX
148,setTextureRegion
149,extension
150,solveTOIPositionConstraints
151,rotateY
152,isImage
153,destroyProxy
154,and
155,newInstance
156,delegate
157,pop
158,reverse
159,reset
160,asReadOnlyBuffer
161,protectedArrayOffset
162,protectedHasArray
163,asFloatBuffer
164,SetLcLpPb
165,equals
166,setLength
167,setTapSquareSize
168,getDeltaY
169,computeHeight
170,createVelocityValue
171,btAdjustAngleToLimits
172,slice
173,triangulate
174,evaluate
175,getMaxBalance
176,circumference
177,isComplete
178,writer
179,writeString
180,path
181,getAbsoluteFile
182,isDirectory
183,listRoots
184,markSupported
185,getBillboardBatch
186,prepare
187,createTempFile
188,isUsingDefaultTexture
189,openEffect
190,removeIndex
191,createColorTexture
192,protectedArray
193,getUnderlineThickness
194,hasKerning
195,getLocalAnchorB
196,setMaxForce
197,createFrustumModel
198,parseMaterials
199,BVH
200,CONTACT
201,glIsRenderbuffer
202,glDeleteBuffer
203,glPixelStorei
204,glUseProgram
205,glBindRenderbuffer
206,glBlitFramebuffer
207,glDeleteFramebuffer
208,glDrawElements
209,glFlush
210,glFlushMappedBufferRange
211,glFramebufferTextureLayer
212,glGenBuffers
213,glGenerateMipmap
214,glGetStringi
215,glShaderSource
216,glStencilOpSeparate
217,glSamplerParameterfv
218,resolveErrorNumber
219,chooseConfig
220,printConfigs
221,destroySurfaceImp
222,throwEglException
223,stopPolling
224,getPixel
225,printConfig
226,readyToDraw
227,testPixmaps
228,generate
229,main
230,parseArgs
231,setMaxFlingDelay
232,longPress
233,getV2
234,getXOffset
235,debug
236,glActiveTexture
237,glAttachShader
238,glCompileShader
239,glFinish
240,initializeComponents
241,glGetShaderPrecisionFormat
242,glIsTexture
243,glIsShader
244,glUniform1i
245,glValidateProgram
246,glVertexAttrib4f
247,renderGlyph
248,glEnableVertexAttribArray
249,glCopyTexImage2D
250,glGenRenderbuffer
251,glGetRenderbufferParameteriv
252,glVertexAttribPointer
253,getAccelerometerX
254,getAvailablePointer
255,getAzimuth
256,getCurrentEventTime
257,onfinish
258,setOnCompletionListener
259,glGetShaderInfoLog
260,justTouched
261,setCursorPosition
262,getPaddingAdvanceX
263,isFont2Active
264,setPaddingAdvanceY
265,setPaddingBottom
266,getPositionAt
267,updateValues
268,getMNumFaces
269,invalidate
270,error
271,setOutputVertices
272,updateFont
273,newCursor
274,viewWillAppear
275,createDefaultTextField
276,getPosition
277,stop
278,getSoundSource
279,containsKey
280,paintComponent
281,getStyle
282,touchDown
283,getProcessors
284,getStart
285,remove
286,clear
287,getAndIncrementStash
288,removeStashIndex
289,values
290,containsValue
291,hash3
292,getCPtr
293,getInterpolation
294,intersectLinePlane
295,intersectSegmentCircle
296,triangleEquals
297,isPointInPolygon
298,getBufferCType
299,setContents
300,child
301,glClear
302,glDepthMask
303,glGetError
304,isGL20Available
305,isPeripheralAvailable
306,unescape
307,asLong
308,size
309,getSerializer
310,writeObjectEnd
311,seek
312,btLog
313,btSqrt
314,quatRotate
315,readShort
316,getLanguage
317,first
318,toNewString
319,getFiles
320,getLwjglAWTCanvas
321,removeNotify
322,executeRunnables
323,removeLifecycleListener
324,glDeleteTextures
325,glGetBufferParameteriv
326,glGetProgramiv
327,glCheckFramebufferStatus
328,glCopyBufferSubData
329,glGetVertexAttribIiv
330,glUniformMatrix2x3fv
331,glUniformMatrix3x2fv
332,setVisible
333,glClearBufferfi
334,compress
335,getIndex
336,getColor
337,add
338,mul
339,solve22ToOut
340,setDisplayMode
341,mul22ToOutUnsafe
342,ceilPositive
343,log
344,round
345,rotate
346,setToRotationRad
347,getScaleX
348,addVertex
349,transformNormal
350,setMesh
351,getFrameId
352,getRawDeltaTime
353,getPitch
354,getRotation
355,createSphere
356,getGL20
357,getAngularOffset
358,extendStack
359,needsGL20
360,processDirectory
361,setPadRight
362,getScreenVectorToWorld
363,findKey
364,findNextIndex
365,emitJniSetupCode
366,putResize
367,putStash
368,toArray
369,push
370,hasNext
371,getVersionName
372,isMono
373,setSoundGain
374,isLooping
375,setup
376,loop
377,close
378,setIndices
379,removeArray
380,init
381,onLoaded
382,setView
383,obtain
384,loadImage
385,save
386,addParticles
387,flipY
388,getHighMax
389,getTimeline
390,isAlwaysActive
391,isBehind
392,setRelative
393,setSide
394,getDefaultFragmentShader
395,IsProxyInvalid
396,computeTag
397,getParticleMass
398,getParticleUserDataBuffer
399,limitCapacity
400,load
401,createShader
402,computeParticleCollisionEnergy
403,setParticleBuffer
404,interpolate
405,setFlipY
406,getPackToTexture
407,isManaged
408,fill
409,fillCircle
410,getGLFormat
411,spawnAux
412,getX
413,isBinary
414,setMaxMotorForce
415,getPercent
416,getStepSize
417,setDisabled
418,setStepSize
419,getGroundAnchorB
420,conjugate
421,cpy
422,addFirst
423,nextBoolean
424,finalize
425,isReadOnly
426,putInt
427,duplicate
428,compact
429,getAspectRatio
430,invoke
431,getJniSections
432,getAmount
433,getRunnable
434,p
435,invokeM
436,setScaling
437,sortMethodsAndSections
438,setFromAxes
439,apply
440,getScrollX
441,getVisualScrollPercentY
442,hit
443,isBottomEdge
444,select
445,isEmpty
446,show
447,setUniformMatrix
448,getBlurKernelSize
449,addRegions
450,setNumNodes
451,getAnchorHardness
452,getLinearStiffness
453,getRot
454,getPad
455,getMaxSelfCollisionImpulse
456,ProjectOnAxis
457,getAccumulatedForce
458,Sub
459,getLoadedSound
460,setSpawnShapeValue
461,actionPerformed
462,Clamp
463,getPrefWidth
464,createDefaultShader
465,getOriginY
466,setAlpha
467,setBounds
468,setX
469,setViewport
470,getBlendMode
471,setBlendMode
472,copyStream
473,normalize
474,act
475,drawBackground
476,getPadRightValue
477,getPadX
478,getRow
479,pad
480,row
481,setClip
482,continueCursor
483,getOnscreenKeyboard
484,setTextFieldListener
485,getSelectedRegions
486,setPosition
487,setSize
488,setRound
489,pack
490,getDepth
491,isFlipVertically
492,minRunLength
493,setAlways
494,loadTileSheets
495,isFlipHorizontally
496,getConstructors
497,isPrimitive
498,ctrl
499,drawString
500,getRenderType
501,setGamma
502,setMono
503,percentWidth
504,absToOut
505,setZero
506,getFields
507,initializeFont
508,crossToOutUnsafe
509,findByUsage
510,getBuffer
511,getPadTop
512,getScreenHeight
513,unbind
514,setScreenBounds
515,createShaderProgram
516,getTitleTable
517,mouseMoved
518,setModal
519,addType
520,getParticleContactCount
521,getTreeHeight
522,setParticleRadius
523,getSpringDampingRatio
524,resolve
525,setParticleUserDataBuffer
526,drawParticleSystem
527,fit
528,getHigh
529,getSoftness
530,test
531,updateHandle
532,Simplex1to4
533,getBox1
534,getHalfExtentsWithoutMargin
535,getInternalTmpValue
536,loadFile
537,getOptimizedBvh
538,setPadding
539,getTriangleInfoMap
540,setTriangleInfoMap
541,setSwapped
542,setDispatcherFlags
543,at
544,expand
545,getClosestPoints
546,getFriction
547,getAnisotropicFriction
548,getInternalType
549,setAnisotropicFriction
550,setInterpolationWorldTransform
551,getCompanionId
552,setShape
553,checkCollideWith
554,getWorldTransform
555,serializeSingleObject
556,setContactCallbackFlag
557,isInfinite
558,setLocalScaling
559,convexSweepTest
560,getSwingSpan2
561,internalGetCollisionShape
562,setLimitSoftness
563,setAngularOnly
564,getAccumImpulse
565,getJacDiagInv
566,setRhs
567,getSplitImpulse
568,getRestingContactRestitutionThreshold
569,setDamping
570,setChildMargin
571,reportFailure
572,setFraction
573,solve
574,setMinimumPointsPerturbationThreshold
575,getNumUnscaledPoints
576,addPoint
577,recalcLocalAabb
578,getLocalScaling
579,setCollisionMargin
580,getME
581,setME
582,getRestitution
583,getCollisionShapeData
584,getAabbSlow
585,getNumPreferredPenetrationDirections
586,Extents
587,getOverlappingPairCache
588,setDupdates
589,setPrediction
590,setReleasepaircache
591,initSeparatingDistance
592,benchmark
593,setSets
594,getChild1
595,getVolume
596,countLeaves
597,getMask
598,getStkStack
599,setOpath
600,getDefaultMaxCollisionAlgorithmPoolSize
601,setStartWorldTrans
602,getMaximumDistanceSquared
603,setSynchronizeAllMotionStates
604,getUseEpa
605,setAllowedCcdPenetration
606,getVertex
607,getNodeBound
608,updateBound
609,setRbBFrame
610,getParam
611,getUseSolveConstraintObsolete
612,setFrames
613,getAngularEnableMotor
614,getRotateOrder
615,setAngularLowerLimit
616,setAngularServoTarget
617,setLinearEnableMotor
618,setLimitReversed
619,getSpringStiffness
620,setAxis
621,Penetration
622,SignedDistance
623,getUseReferenceFrameA
624,setUpperLimit
625,getBiasFactor
626,setPadding1
627,addCollisionObject
628,setMotorTarget
629,drawSphere
630,getContactPoint
631,getNumTriangles
632,setBJ
633,setAppliedTorqueBodyB
634,getAngularBounce
635,setMaxSlope
636,setVertices
637,setUpAxis
638,getContactMotion1
639,setUserValue
640,setNumMaterials
641,setIndices32
642,getPadding
643,getAabbMaxOrg
644,setInternalGhostPairCallback
645,clearManifold
646,validContactDistance
647,getNormal
648,setPlane
649,setBvhAabbMin
650,getNumQuantizedContiguousNodes
651,getQuantizedAabbMin
652,calculateSerializeBufferSize
653,calculateSerializeBufferSizeNew
654,deSerializeInPlace
655,getAlignmentSerializationPadding
656,setFloats
657,getSuspensionCompression
658,setFrictionSlip
659,setAngularFactor
660,setInvInertiaLocal
661,setInverseMass
662,setTotalTorque
663,setLinearFactor
664,getCollisionShape
665,getNumConstraintRefs
666,isInWorld
667,setAdditionalAngularDampingFactor
668,setAngularSleepingThreshold
669,getEnableMotor
670,getLoLimit
671,getNormalCFM
672,nearest
673,getTotalTorque
674,setLinearLowerLimit
675,getMass
676,getAngularPos
677,getRestitutionOrthoAng
678,getSolveLinLimit
679,getUpperAngLimit
680,setLowerLinLimit
681,setAnchors
682,setNodes
683,Draw
684,getRelPosition
685,copySoftBodyToVertexBuffer
686,getWater
687,setDampingDirAng
688,setPose
689,dampClusters
690,getAabb
691,getColObj
692,getFace
693,getFramexform
694,getInitialWorldTransform
695,getLv
696,getRank
697,getScontacts
698,getSdrift
699,setDrift
700,setFramexform
701,setKKHR
702,setKSS
703,setMaxlife
704,clusterDImpulse
705,getLinks
706,getVertices
707,setRank
708,setRestLengthScale
709,setTests
710,setText
711,getInvMass
712,writebackVelocity
713,getSolverBodyIdA
714,setCfm
715,needsBroadphaseCollision
716,setF
717,setNqueries
718,getPlaneNormal
719,preallocateVertices
720,getIdentity
721,getBounce
722,setEquilibriumPoint
723,setLowerLimit
724,getPartId
725,getAllowedPenetration
726,getEdgeV1V2Angle
727,deSerialize
728,getQuantizedFloatBvh
729,setMeshInterface
730,setUnusedPadding4
731,setFlags
732,getPlaneEquation
733,processTriangle
734,getRbA
735,getUse32bitIndices
736,setDbgDrawSize
737,serialize
738,getAppliedImpulse
739,setOverrideNumSolverIterations
740,getBreakingImpulseThreshold
741,getFindex
742,getOverrideNumSolverIterations
743,setParam
744,Free
745,getUsedVertexD
746,getJointFeedback
747,setUsedVertexD
748,setMax
749,absolute4
750,setValue
751,pointOutsideOfPlane
752,setCachedBC
753,updateClosestVectorAndPoints
754,setBIsFrontWheel
755,getChassisConnectionPointCS
756,getSuspensionLength
757,setBrake
758,setEngineForce
759,setRotation
760,setSuspensionLength
761,createCylinderShapeZ
762,getW
763,getWheelDirectionCS
764,setY
765,createGearConstraint
766,prepareCamera
767,getTarget
768,setTarget
769,removeAction
770,stageToLocalAmount
771,clipEnd
772,screenToLocalCoordinates
773,setName
774,setToRotation
775,setToShearing
776,filter
777,getAlpha
778,newAudioDevice
779,newMusic
780,onDreamingStopped
781,internal
782,getAudio
783,getWindowManager
784,useImmersiveMode
785,glDrawBuffers
786,glTransformFeedbackVaryings
787,getDensity
788,isFullscreen
789,logConfig
790,requestRendering
791,onDrawFrame
792,setupGL
793,isCursorCatched
794,lookUpPointerIndex
795,postTap
796,vibrate
797,initialize
798,getApplicationWindow
799,postTouchEvent
800,match
801,clearSpans
802,putInteger
803,getPhiPanel
804,getSharedLibFilename
805,shuffle
806,getGlyph
807,idt
808,getTopHeight
809,isGlobal
810,end
811,validate
812,nextPoint
813,getMap
814,randomColor
815,isUseGPU
816,requirePageGlyphs
817,testHashcodeAndEquals
818,checkCapacity
819,flip
820,nextSetBit
821,getGravityScale
822,getUserData
823,getCenterZ
824,min
825,touchDragged
826,drawJoint
827,setSorter
828,benchShort
829,addDependencies
830,panStop
831,pinch
832,pan
833,newDefaultTarget
834,getButtonGroup
835,canCheck
836,removeAll
837,allocate
838,arrayOffset
839,getReturnType
840,pinchZoom
841,getExpandX
842,getMinWidthValue
843,getSpaceRightValue
844,setActorX
845,setNextVertex
846,incr
847,approximate
848,append
849,array
850,axisLabel
851,isFirstCallPass2
852,getPressedButton
853,getTouchDownY
854,getRayFromWorld
855,setTitle
856,getValues
857,findIncidentEdge
858,premultiplyAlpha
859,mergeCollapse
860,pushRun
861,getSolverArea
862,setAccessible
863,endContact
864,getFixtureAddrA
865,getFixtureAddrB
866,setFriction
867,solveVelocityConstraints
868,prefHeight
869,width
870,setEdges
871,getUp
872,getInterval
873,readLine
874,getDstBlendFactor
875,isAudio
876,testOverlap
877,unbufferMove
878,setDefaultCullFace
879,popMat22
880,with
881,getDescription
882,restart
883,combineAttributes
884,getElementSize
885,wrap
886,setDragActor
887,getButton
888,setButton
889,removeLeaf
890,deleteVelocity
891,getAvailableVelocities
892,getGDisableDeactivation
893,balance
894,showValueDialog
895,hasPKMHeader
896,setParticleCount
897,InitBitModels
898,handle
899,isHandled
900,detach
901,parent
902,deleteDirectory
903,exists
904,type
905,skip
906,setTextureFilter
907,refilter
908,saveEffect
909,useMipMaps
910,isFocused
911,legalAtStart
912,getHoriBearingY
913,getVertBearingY
914,newMemoryFace
915,glCreateProgram
916,glDeleteRenderbuffers
917,glTexImage2D
918,glUniform3iv
919,glGetActiveUniformsiv
920,glGetInteger64v
921,glIsTransformFeedback
922,glReadBuffer
923,glReadPixels
924,glUniform3fv
925,glVertexAttrib2fv
926,setFrameBufferViewport
927,enable
928,findConfigAttrib
929,setRenderMode
930,surfaceChanged
931,getPixels
932,createContext
933,isEmptyDirectory
934,convertTools
935,onCreate
936,setRatio
937,mousePressed
938,clearChildren
939,setDebug
940,getSliderX
941,fixSlashes
942,pathWithoutExtension
943,glBlendFunc
944,glBufferSubData
945,checkError
946,glDisable
947,glDrawArrays
948,glSampleCoverage
949,glUniform2iv
950,glGetProgramInfoLog
951,glLineWidth
952,glGetUniformLocation
953,getResultAsString
954,setVolume
955,isKeyJustPressed
956,flush
957,putBoolean
958,getFill
959,getGamma
960,isBold
961,basicAuthentication
962,setMVcount
963,url
964,setMVertexStride
965,checkFileExistence
966,loadBundle
967,processRunnables
968,getPpcX
969,touchesCancelled
970,setInputProcessor
971,iterator
972,createImage
973,addImage
974,getImageY
975,buildVertexAttributes
976,ReadBlock
977,SetStream
978,keyTyped
979,isDirect
980,removeStash
981,isPlainOldDataType
982,frame
983,getInput
984,shouldExit
985,glCompressedTexImage2D
986,glStencilMask
987,glUniform4fv
988,setVSync
989,getFromJar
990,setSharedLibraryFinder
991,readField
992,setDefaultSerializer
993,setWriter
994,toJson
995,disposePreparedData
996,getGlyphLayout
997,GEN
998,btFmod
999,btUnswapEndianDouble
1000,inverse
1001,length
1002,readByte
1003,skipBytes
1004,readFields
1005,getHitCollisionObject
1006,getShapePart
1007,readBoolean
1008,hasArray
1009,getDesktopDisplayMode
1010,isKeyPressed
1011,getPreferences
1012,glBlendEquation
1013,ensureBufferCapacity
1014,glDeleteShader
1015,glGetIntegerv
1016,glGetTexParameteriv
1017,glRenderbufferStorage
1018,glTexParameteri
1019,glTexSubImage2D
1020,glUniform2i
1021,glVertexAttrib3f
1022,glBindBufferBase
1023,glBindFramebuffer
1024,glIsFramebuffer
1025,fullCompatibleWithGLES3
1026,isSoftwareMode
1027,abs
1028,createScaleTransform
1029,glResumeTransformFeedback
1030,scl
1031,setToTranslation
1032,getScaleZSquared
1033,cleanup
1034,line
1035,setColor
1036,setVertexTransform
1037,triangle
1038,bench
1039,findPositionForNewNodeBottomLeft
1040,ellipse
1041,vertex
1042,setCol
1043,getDeclaredAnnotation
1044,getDeclaringClass
1045,isAccessible
1046,isNative
1047,isPublic
1048,isStatic
1049,generateMipMapGLES20
1050,getHeight
1051,createCone
1052,loadModel
1053,getAnimation
1054,getCorrectionFactor
1055,setMiddleHeight
1056,setCamera
1057,copyAnimations
1058,getAndIncrement
1059,getSampleRate
1060,axisMoved
1061,getVersionNumber
1062,allocateChannel
1063,activateParticles
1064,bind
1065,start
1066,windowClosed
1067,getColors
1068,getSpawnShape
1069,isPremultipliedAlpha
1070,newLowValue
1071,setTransform
1072,loadEmitterImages
1073,begin
1074,createPrefix
1075,updateBodyContacts
1076,sort
1077,getGLInternalFormat
1078,unPlug
1079,setPolygon
1080,is
1081,getBlendSrcFunc
1082,solvePowder
1083,computeDistanceToOut
1084,setPolyline
1085,freeAll
1086,getSpawnWidth
1087,getAxisAngle
1088,toStringTest
1089,getFilePointer
1090,readDouble
1091,readInt
1092,setLow
1093,forNameC
1094,getArrayLengthT
1095,getF
1096,getDelay
1097,getDeltaX
1098,loadAsset
1099,generateLookups
1100,getMouseWheelY
1101,getScale
1102,resetFade
1103,getSelectedIndex
1104,isScrollingDisabledX
1105,isDisabled
1106,getAttributes
1107,getUniformSize
1108,setUniform4fv
1109,setBlurKernelSize
1110,getTransformMatrix
1111,random
1112,createTypeGenerator
1113,truncate
1114,compare
1115,setLdamping
1116,setNvimpulses
1117,curve
1118,getNodeIndices
1119,getAttach
1120,getNumWeigts
1121,setNumWeigts
1122,loadSync
1123,setEdgesVisible
1124,setProjectionMatrix
1125,setShader
1126,VolumeOf
1127,setCurrentSpawnData
1128,setV2
1129,switchStage
1130,fillGroup
1131,getDebugColor
1132,ceil
1133,getChars
1134,advance
1135,columnDefaults
1136,getRowHeight
1137,setKeyboardFocus
1138,getFirstLineShowing
1139,setBackground
1140,acceptChar
1141,clearSelection
1142,clicked
1143,drawText
1144,getTextFieldFilter
1145,letterUnderCursor
1146,selectAll
1147,setOnlyFontChars
1148,createSprite
1149,createSprites
1150,calculateOffsets
1151,getY
1152,getTextures
1153,merge
1154,replaceEscapeChars
1155,setU
1156,processSingleMap
1157,processSubdirectories
1158,getFlipHorizontally
1159,millis
1160,getKnobPercentY
1161,setDeadzone
1162,selectNodes
1163,getDeclaredMethods
1164,value
1165,computeSize
1166,gallopRight
1167,getDescent
1168,getGlyphPageWidth
1169,mulLocal
1170,fromString
1171,nor
1172,getNumMaxVertices
1173,updateVertices
1174,getPadRight
1175,getWorldHeight
1176,uniform2fv
1177,invalidateHierarchy
1178,isDragging
1179,getSeparations
1180,layout
1181,seekToChunk
1182,getDestructionListener
1183,getJointList
1184,getTreeBalance
1185,setParticleDestructionListener
1186,collide
1187,overlapping
1188,getSign
1189,getMinEdges
1190,setPos
1191,setOffsetFromFile
1192,unQuantize
1193,setMaxEdges
1194,getAabbMin
1195,getMultiSapParentProxy
1196,addHandle
1197,setMultiSapParentProxy
1198,getQuantizedAabbMax
1199,getLeftNode
1200,getUpAxis
1201,canJump
1202,getAllContactManifolds
1203,drawShape
1204,getRootCollisionShape
1205,setInterpolationLinearVelocity
1206,getShape
1207,internalTemp
1208,getUserValue
1209,setIslandTag
1210,setShapeType
1211,getDispatcher
1212,getChildAlgorithm
1213,getChildShapePtr
1214,getChildList
1215,setConvexInternalShapeData
1216,setBiasFactor
1217,getTimeStep
1218,getErp2
1219,setMaxGyroscopicForce
1220,setRestingContactRestitutionThreshold
1221,setSolverMode
1222,setSplitImpulseTurnErp
1223,getManifold
1224,setHitTransformA
1225,getSimplexSolver
1226,setPdSolver
1227,getEdges
1228,setPoints
1229,setFaces
1230,updateSeparatingDistance
1231,getTriangleCount
1232,getFupdates
1233,getNeedcleanup
1234,empty
1235,setNode
1236,getPersistentManifoldPool
1237,getCenterOfMassOffset
1238,getConstraint
1239,getSynchronizeAllMotionStates
1240,getConvexConservativeDistanceThreshold
1241,setStepCount
1242,getNodeCount
1243,setCollisionShapeData
1244,setLock
1245,getBulletTetrahedron
1246,getInfo1NonVirtual
1247,getLinearEquilibriumPoint
1248,getAngularMotorCFM
1249,setAngularSpringDamping
1250,getAngularLowerLimitReversed
1251,setNumTasks
1252,gimpact
1253,getOverlappingObject
1254,addOverlappingPair
1255,setWitnesses
1256,getCatchDegeneracies
1257,setLastUsedMethod
1258,setPenetrationDepthSolver
1259,getHash
1260,removeOverlappingPair
1261,setAccumulatedHingeAngle
1262,getEnableAngularMotor
1263,setMaxMotorImpulse
1264,setTypeConstraintData
1265,freeMemory
1266,setCatchDegeneracies
1267,getRbBFrame
1268,setUseFrameOffset
1269,draw3dText
1270,drawTransform
1271,getInstance
1272,getVertexBase
1273,setVertexType
1274,getGhostObject
1275,setFallSpeed
1276,getIndex0
1277,getUserPersistentData
1278,setCombinedRestitution
1279,setContactMotion1
1280,setIndex1
1281,calculateCombinedRestitution
1282,buildTree
1283,setSubPart
1284,getPositionWorldOnA
1285,get3indices16
1286,findLinearSearch
1287,addManifoldPoint
1288,clearUserCache
1289,getPointInWorld
1290,overlap
1291,getUseQuantization
1292,setNumContiguousLeafNodes
1293,setTraversalMode
1294,getQuantizedContiguousNodesPtr
1295,testQuantizedBoxOverlapp
1296,setQuantizationValues
1297,getAxis
1298,setSteeringValue
1299,setAdditionalDamping
1300,setInvInertiaTensorWorld
1301,getLocalInertia
1302,setCenterOfMassTransform
1303,getTargetVelocity
1304,setMotorCFM
1305,setValues
1306,getIndexB
1307,getRandSeed
1308,getRestitutionLimAng
1309,setDampingLimLin
1310,getLinearVelocity
1311,getDampingDirLin
1312,CreateFromTetGenData
1313,getBodyBtype
1314,setNumberOfVelocityIterations
1315,Eval
1316,SwigConstructbtSoftBody
1317,addVelocity
1318,appendFace
1319,applyImpulse
1320,applyVAImpulse
1321,getAqq
1322,getBbending
1323,clusterVImpulse
1324,getFlags
1325,getInfluence
1326,getKDP
1327,setTimeStepAndCounters
1328,applyDImpulse
1329,getIndices
1330,getRefs
1331,prepareClusters
1332,setConfig
1333,setKCHR
1334,setLocii
1335,setRpos
1336,setSolver
1337,updateClusters
1338,getStamargin
1339,setFrictionIndex
1340,setRelpos1CrossNormal
1341,getI
1342,getNqueries
1343,setHash
1344,setNext
1345,setNormalOnSurfaceB
1346,getDegenerate
1347,setClosestPointOnSimplex
1348,calculateDiffAxisAngleQuaternion
1349,setBounce
1350,setEnableSpring
1351,setSpringStiffnessLimited
1352,getCurrentLimitError
1353,setRestitution
1354,getConvexShape
1355,addMaterialProperties
1356,getHashTableSize
1357,getNumKeys
1358,setZeroAreaThreshold
1359,setEdgeDistanceThreshold
1360,setEdgeV1V2Angle
1361,setQuantizedDoubleBvh
1362,getUsedVertices
1363,getDbgDrawSize
1364,getDisableCollisionsBetweenLinkedBodies
1365,getIsEnabled
1366,setIsEnabled
1367,setObjectType
1368,getConstraintError
1369,internalGetAppliedImpulse
1370,setEnabled
1371,setJ2linearAxis
1372,setUnused1
1373,setUnused4
1374,hasNormals
1375,setWheelsDampingCompression
1376,getGroundObject
1377,getSkidInfo
1378,getWheelsRadius
1379,setRollInfluence
1380,createBvhTriangleMeshShape
1381,createCapsuleShapeY
1382,createConeShapeX
1383,createCylinderShapeX
1384,createScaledTrangleMeshShape
1385,getNumCollisionShapes
1386,createSphereShape
1387,getTop
1388,preShear
1389,getHandler
1390,newAudioRecorder
1391,hideStatusBar
1392,setAPKExpansion
1393,addLifecycleListener
1394,createLayoutParams
1395,glGetQueryObjectuiv
1396,glVertexAttribI4ui
1397,getGraphics
1398,createGLSurfaceView
1399,getFramesPerSecond
1400,preserveEGLContextOnPause
1401,onPause
1402,onResume
1403,startActivity
1404,getDuration
1405,nextSpanTransition
1406,onGenericMotion
1407,gatherSourceFiles
1408,getString
1409,getLibsDirectory
1410,next
1411,peekValue
1412,isUseInlineBase64
1413,loadAudio
1414,setUseBrowserCache
1415,getAssetNames
1416,valueAt
1417,lerp
1418,asCharBuffer
1419,asIntBuffer
1420,nextSpot
1421,decode
1422,encode
1423,StateUpdateRep
1424,Init
1425,down
1426,peek
1427,ReverseEncode
1428,getFixtureList
1429,renderCachedScaled
1430,getCorner000
1431,getMax
1432,isDrawVelocities
1433,mark
1434,setUncheckLast
1435,getMinWidth
1436,isPressed
1437,space
1438,UpdateByte
1439,fillX
1440,getComputedPadLeft
1441,getSpaceTop
1442,fillVerticesToViewPointCPU
1443,getPadLeft
1444,height
1445,prefSize
1446,setActorY
1447,right
1448,addAll
1449,getImageCell
1450,clone
1451,getCause
1452,setHitPointWorld
1453,testMap
1454,createReflection
1455,allocateChannels
1456,rgb888
1457,bytesToHex
1458,getKey
1459,setARGBA
1460,isEnabled
1461,addActorBefore
1462,align
1463,warmStart
1464,fillY
1465,getAlign
1466,maxWidth
1467,removeActor
1468,buttonDown
1469,onInputDeviceRemoved
1470,tap
1471,flushAndSyncTransformMatrix
1472,writeShort
1473,getZ
1474,lookAt
1475,setHeight
1476,initializeVelocityConstraints
1477,resetVertices
1478,treeCallback
1479,setDefaultDepthFunc
1480,getFloatArray
1481,popVec2
1482,getVec2Array
1483,canRender
1484,removeListener
1485,putLong
1486,drag
1487,rebuildBottomUp
1488,getVertex0
1489,getVertex1
1490,getVertex2
1491,getVertex3
1492,setHasVertex3
1493,area
1494,getMaxParticleCount
1495,GetPrice0
1496,execute
1497,tableChanged
1498,mkdirs
1499,readString
1500,addInfluencer
1501,setDrawXYZ
1502,animate
1503,createStroker
1504,getWidth
1505,getMaxForce
1506,createFonts
1507,glBindBuffer
1508,glCopyTexSubImage2D
1509,glGenRenderbuffers
1510,glGetUniformiv
1511,glUniform1f
1512,glUniform3f
1513,glUniform4i
1514,glIsProgram
1515,glVertexAttrib4fv
1516,glClearBufferiv
1517,glGenVertexArrays
1518,glGetVertexAttribiv
1519,glCopyTexSubImage3D
1520,glGetBufferPointerv
1521,glSamplerParameteriv
1522,glScissor
1523,glUniformMatrix3fv
1524,consumeCustomData
1525,onMeasure
1526,setEGLWindowSurfaceFactory
1527,onGamepadDisconnect
1528,startPolling
1529,getFormat
1530,readAPIVersion
1531,glTexSubImage3D
1532,getRatio
1533,setFilter
1534,getPreloader
1535,onVisibilityChange
1536,writeFile
1537,glGetVertexAttribfv
1538,glColorMask
1539,glGetUniformfv
1540,glDetachShader
1541,glHint
1542,glIsBuffer
1543,glUniformMatrix2fv
1544,glVertexAttrib3fv
1545,getContext
1546,getBoolean
1547,setupEventQueue
1548,getRoll
1549,setCursorCatched
1550,putFloat
1551,getFont2File
1552,getPaddingBottom
1553,getPaddingRight
1554,setGlyphText
1555,setPaddingAdvanceX
1556,method
1557,setMMaxVertices
1558,createBundle
1559,getExceptionOnMissingKey
1560,Descent
1561,getUIViewController
1562,glViewport
1563,getKeyboardTextField
1564,getRects
1565,getImages
1566,getMaxVertices
1567,ReduceOffsets
1568,setCharacter
1569,available
1570,containsKeyStash
1571,insertImage
1572,getSide
1573,getClipboard
1574,keys
1575,isPaused
1576,file
1577,glBindAttribLocation
1578,glBlendColor
1579,glClearStencil
1580,glUniform2f
1581,crc
1582,asInt
1583,getTextInput
1584,getByte
1585,addClassTag
1586,setEnumNames
1587,getJglfwKeyCode
1588,getDefaultValues
1589,btRayAabb
1590,btSwapEndian
1591,btTriple
1592,slerp
1593,readLong
1594,setSelected
1595,onCreateApplication
1596,getCollisionObject
1597,getTriangleIndex
1598,isActive
1599,getAccelerometerZ
1600,getFrameRate
1601,glDeleteRenderbuffer
1602,glFrontFace
1603,glDeleteQueries
1604,glStencilFunc
1605,shouldRender
1606,updateTime
1607,getStash
1608,getProperties
1609,getKeys
1610,matches
1611,isEqual
1612,randomBoolean
1613,trn
1614,atan2
1615,commonIntervalLength
1616,contactPointScoreNode
1617,getIndicesBuffer
1618,makeVertexBuffer
1619,getVertexAttributes
1620,getBufferFormat
1621,getGL30
1622,isCatchMenuKey
1623,getAnchorA
1624,setFrequency
1625,emitJniSection
1626,getStatus
1627,setTimeOut
1628,getRightWidth
1629,setPadLeft
1630,hash2
1631,loadAnimations
1632,calculateBoneTransforms
1633,buttonReleased
1634,run
1635,ySliderMoved
1636,getAxisCount
1637,scrolled
1638,Flush
1639,ReleaseStream
1640,setMFaceCount
1641,addAction
1642,findInfluencer
1643,getVelocity
1644,isContinuous
1645,isRelative
1646,setHighMin
1647,setBehind
1648,setLowMin
1649,IsContactInvalid
1650,getParticleInvMass
1651,getDefaultVertexShader
1652,stopThread
1653,generateTextureAtlas
1654,setDuplicateBorder
1655,getComposite
1656,createParticle
1657,raycast
1658,renderTileLayer
1659,getDependencies
1660,clamp
1661,getKnobPosition
1662,getLength1
1663,setFromMatrix
1664,readUTF
1665,writeFloat
1666,writeUTF
1667,computeMass
1668,needsCollision
1669,getEndPoint
1670,putShort
1671,getArrayElementT
1672,getArrayLength
1673,getLife
1674,newArrayC
1675,getResizeCheckDelay
1676,getSaveData
1677,updateRelative
1678,gatherTypes
1679,setUnitsPerPixel
1680,getMaxY
1681,getScrollBarWidth
1682,getScrollPercentY
1683,isFlinging
1684,setCancelTouchFocus
1685,updateVisualScroll
1686,restore
1687,addManagedShader
1688,isCompiled
1689,blur
1690,linkProgram
1691,setYDistance
1692,setTransformMatrix
1693,indexOf
1694,rect
1695,setAmountHeight
1696,getAtlas
1697,enter
1698,removeValue
1699,getSelfCollisionImpulseFactor
1700,setCollide
1701,setContainsAnchor
1702,setMasses
1703,getLift
1704,setSoftKineticClusterHardness
1705,setSoftRigidClusterHardness
1706,getInverseMass
1707,setRestVolume
1708,setMaterial
1709,setSidesVisible
1710,disableBlending
1711,renderSprites
1712,scale
1713,getPrefHeight
1714,addCaptureListener
1715,removeTouchFocus
1716,setMultipleSelectionAllowed
1717,goEnd
1718,getLabel
1719,getBoundingRectangle
1720,setRegion
1721,moveCursor
1722,setPasswordMode
1723,getCurrentRegionPanel
1724,setPasswordCharacter
1725,getRegion
1726,setRegionY
1727,setAtlas
1728,setCell
1729,getTileSets
1730,rangeCheck
1731,assertAbsoluteEqual
1732,loadImages
1733,findMinSeparation
1734,getLevel
1735,getNodeAt
1736,loadTilemap
1737,setOverNode
1738,timeOfImpact
1739,addGlyphs
1740,createFont
1741,getAscent
1742,loadSettings
1743,widen
1744,subLocal
1745,dst2
1746,hasOppositeDirection
1747,setAngle
1748,getNumVertices
1749,padTop
1750,rotateRad
1751,prj
1752,drawUnicode
1753,createPerspectiveMatrix
1754,getReactionTorque
1755,sizeChanged
1756,standardDeviation
1757,getPoints
1758,getJointCount
1759,getParticleRadius
1760,setParticleGravityScale
1761,calculateVertices
1762,getDbvtProxy
1763,getAddress
1764,process
1765,getClientObject
1766,setQuantizedAabbMax
1767,setQuantizedAabbMin
1768,buildOptimizedBvh
1769,CreateCollisionAlgorithm
1770,getManifoldByIndexInternal
1771,expandNonInitializing
1772,findBinarySearch
1773,setDispatcher1
1774,getInterpolationAngularVelocity
1775,getCcdSweptSphereRadius
1776,isStaticObject
1777,getShapeType
1778,calculateLocalInertia
1779,debugDrawWorld
1780,getHasAnisotropicFriction
1781,setBroadphase
1782,getChildShapeType
1783,addChildShape
1784,getDamping
1785,getTwistAngle
1786,setFixThresh
1787,setSplitImpulse
1788,setLinearSlop
1789,getSplitImpulseTurnErp
1790,setDebugDrawer
1791,setUnscaledPointsDoublePtr
1792,getNumPoints
1793,getNumCollisionObjects
1794,getImplicitShapeDimensions
1795,calcPenDepth
1796,getConvexInternalShapeData
1797,Contain
1798,collideTTpersistentStack
1799,getSwingSpan1
1800,setDefaultMaxCollisionAlgorithmPoolSize
1801,setDefaultMaxPersistentManifoldPoolSize
1802,setGraphicsWorldTrans
1803,setDebugDraw
1804,setDispatchFunc
1805,setEnableSPU
1806,getSolverInfo
1807,Link
1808,setPart1
1809,getAngularLowerLimit
1810,setUseSolveConstraintObsolete
1811,getAngularServoMotor
1812,getAngularServoTarget
1813,setLinearSpringDamping
1814,getAngularTargetVelocity
1815,getLinearEnableMotor
1816,getLinearSpringStiffnessLimited
1817,setAngularTargetVelocity
1818,findAlgorithm
1819,setLinearStopCFM
1820,setAngularUpperLimit
1821,getFrameOffsetB
1822,setLinearUpperLimit
1823,getEquilibriumPoint
1824,getSpringDamping
1825,getPool
1826,addOverlappingObjectInternal
1827,getDistance
1828,setDistance
1829,setStatus
1830,getPointer
1831,getLowerLimit
1832,getPadding1
1833,getDisabledSimulationObject
1834,getAJ
1835,getRelativeVelocity
1836,getDistance1
1837,setLocalPointB
1838,setPositionWorldOnA
1839,getMaterialBase
1840,getNumMaterials
1841,getTriangleMaterialsBase
1842,setPad
1843,setNumTriangles
1844,GetTransformB
1845,setWorldTransform
1846,findPair
1847,initializeFromBuffer
1848,getContactBreakingThreshold
1849,getPivotInB
1850,getBvhQuantization
1851,getBvhAabbMax
1852,getTraversalMode
1853,isLeafNode
1854,reportBoxCastOverlappingNodex
1855,getFloats
1856,setEulerZYX
1857,applyEngineForce
1858,getChassisWorldTransform
1859,getWheelInfo
1860,setAdditionalDampingFactor
1861,getAngularFactor
1862,getLinearFactor
1863,applyCentralForce
1864,clearForces
1865,computeGyroscopicImpulseImplicit
1866,getLinearSleepingThreshold
1867,setStartWorldTransform
1868,updateInertiaTensor
1869,setCurrentLimit
1870,setWheelInfo
1871,getConstraintRef
1872,getCurrentLimit
1873,getMaxLimitForce
1874,reserve
1875,setTrimeshShapeData
1876,setNextFree
1877,getLinearPos
1878,setDampingOrthoAng
1879,setSoftnessLimAng
1880,DrawInfos
1881,addAeroForceToNode
1882,getC3
1883,getKPR
1884,getRigid
1885,getRv
1886,getVelmrg
1887,indicesToPointers
1888,linearVelocity
1889,refine
1890,setC1
1891,setClusters
1892,setDsequence
1893,setLeaf
1894,setMaxvolume
1895,setNotes
1896,xform
1897,ProcessColObj
1898,getExternalTorqueImpulse
1899,getAngularComponentA
1900,setAppliedPushImpulse
1901,getOverlappingPairArrayPtr
1902,Initialize
1903,setPclient
1904,getBarycentricCoords
1905,setBarycentricCoords
1906,setUsedVertices
1907,setCurrentLimitError
1908,setStopCFM
1909,setConvexShapeTo
1910,getNextSize
1911,getPlanarEpsilon
1912,setFrom
1913,getVertices1
1914,getFixedBody
1915,getJ1linearAxis
1916,needsFeedback
1917,setJ1linearAxis
1918,setUserConstraintPtr
1919,getAnchor
1920,deSerializeDouble
1921,serializeDouble
1922,setW
1923,setHitPointInWorld
1924,backup
1925,getNeedsUpdate
1926,getSimplexVectorW
1927,setCachedV
1928,getRollInfluence
1929,setHardPointWS
1930,createGeneric6DofSpring2Constraint
1931,getConstraintByIndex
1932,didFinishPlaying
1933,moveTo
1934,drawDebug
1935,getScaleY
1936,rotateBy
1937,setOriginX
1938,setOriginY
1939,setTouchable
1940,applyTo
1941,shear
1942,writeSamples
1943,local
1944,glDeleteVertexArrays
1945,glGetVertexAttribIuiv
1946,clearManagedCaches
1947,getDisplayModes
1948,onSensorChanged
1949,getLiveWallpaper
1950,onCommand
1951,openURI
1952,getFilters
1953,getSpanStart
1954,replace
1955,getLong
1956,getTextureRegion
1957,action
1958,copyJniHeaders
1959,contains
1960,loadText
1961,setLogger
1962,unload
1963,same
1964,cubic
1965,setLeftWidth
1966,setTopHeight
1967,hasLight
1968,StateUpdateChar
1969,getBatch
1970,randomPosition
1971,randomizeLights
1972,createAxes
1973,getAlignModeWrapper
1974,getVertexCount
1975,testXor
1976,getMassData
1977,getWorldPoint
1978,setAngularVelocity
1979,ext
1980,getCorner111
1981,getMin
1982,newDirectByteBuffer
1983,benchDouble
1984,addAllProjects
1985,addConfigurations
1986,repeat
1987,setMinCheckCount
1988,afterGroups
1989,getMaxWidthValue
1990,defaults
1991,getChildEdge
1992,init1
1993,computeAABB
1994,exit
1995,getTapCount
1996,getTouchDownX
1997,computeEdgeSeparation
1998,setEndColor
1999,argb8888ToColor
2000,bytesToString
2001,zero
2002,getFillX
2003,getFillY
2004,getNormalImpulses
2005,top
2006,buttonUp
2007,rgb565ToColor
2008,computeIndices
2009,createActorGroup
2010,drawLine
2011,Create
2012,getTimeOfImpact
2013,getDampingRatio
2014,getActor
2015,removeTarget
2016,setDragActorPosition
2017,setInvalidDragActor
2018,resolveSingleBilateral
2019,findEarTip
2020,setHasAdvanced
2021,addEmitter
2022,cutEarTip
2023,Code
2024,bindLights
2025,uiLayout
2026,name
2027,lastModified
2028,addInputSuffix
2029,consumePixmap
2030,calcMeasures
2031,IsDrawXZPlane
2032,getRenderer
2033,getMaxAdvanceWidth
2034,PAIR
2035,glBindTexture
2036,glIsEnabled
2037,glStencilOp
2038,glDeleteTexture
2039,glGenSamplers
2040,TRIANGLE
2041,glUniform1uiv
2042,glDisableVertexAttribArray
2043,flushBuilder
2044,onCreateInputConnection
2045,onDetachedFromWindow
2046,stopEglSurfaceLocked
2047,toGlType
2048,mouseDragged
2049,parseGradleArgs
2050,getInitializedArray
2051,lowestPositiveRoot
2052,triangleCentroid
2053,getOffset
2054,setTopColor
2055,getChildren
2056,isWithinTapSquare
2057,mouseClicked
2058,writeBytes
2059,classpath
2060,glGenTextures
2061,glStencilFuncSeparate
2062,glStencilMaskSeparate
2063,glUniform4f
2064,glVertexAttrib1f
2065,newServerSocket
2066,getUniformLocation
2067,updateSimple
2068,loadLong
2069,getGlyphPageHeight
2070,getPaddingAdvanceY
2071,getMMaxFaces
2072,CreateConvexHull
2073,touchesMoved
2074,setOnscreenKeyboardVisible
2075,getPreferredSize
2076,hash
2077,getImageWidth
2078,getNumMaxIndices
2079,getCharacter
2080,onInternalTick
2081,intersectRayTriangles
2082,setHiddenFPS
2083,glCompressedTexSubImage2D
2084,glFramebufferRenderbuffer
2085,glGetActiveAttrib
2086,glGetAttachedShaders
2087,characterForKeyCode
2088,getAccelerometerY
2089,toGdxButton
2090,getBodyA
2091,number
2092,startObject
2093,keyPressed
2094,getFloat
2095,extractLibrary
2096,asBoolean
2097,quoteName
2098,getWriter
2099,prettyPrint
2100,getNumberOfMipMapLevels
2101,readTableDirectory
2102,readUnsignedShort
2103,readUnsignedLong
2104,btAsin
2105,btExp
2106,btUnswapEndianFloat
2107,setCullingArea
2108,setLocalShapeInfo
2109,offsetChange
2110,mouseWheelMoved
2111,createConfig
2112,getVersion
2113,glDeleteBuffers
2114,glGetAttribLocation
2115,glGetTexParameterfv
2116,glBindSampler
2117,glBindVertexArray
2118,glDeleteFramebuffers
2119,glGenFramebuffers
2120,glBeginQuery
2121,glIsSampler
2122,glSamplerParameterf
2123,initiateGL
2124,getPointCount
2125,addLocal
2126,createRotationalTransform
2127,mulTransLocal
2128,sinDeg
2129,getScaleXSquared
2130,toNormalMatrix
2131,findPositionForNewNodeBestLongSideFit
2132,getOccupancy
2133,ensureTriangles
2134,isVertexTransformationEnabled
2135,lastIndex
2136,supportsExtension
2137,getAmountY
2138,setAmountX
2139,splitFreeNode
2140,copyNodes
2141,emitHeaderInclude
2142,emitLineMarker
2143,findCMethod
2144,getHeaders
2145,addChangeListener
2146,doubleToLongBits
2147,calculateTransforms
2148,getMaterial
2149,getLatency
2150,sliderMoved
2151,isPlaying
2152,entries
2153,orderedKeys
2154,setTranslation
2155,addParticle
2156,allowCompletion
2157,getMinParticleCount
2158,loadEmitters
2159,IsPairInvalid
2160,getParticleGroupBuffer
2161,getParticleGroupCount
2162,reportParticle
2163,setParticleVelocityBuffer
2164,drawRectangle
2165,circle
2166,fastPow
2167,getTexture
2168,setTexture
2169,getPolygon
2170,createParticleGroup
2171,updateContacts
2172,generatePremultiplyAlpha
2173,getDownloadedSize
2174,getSpawnDepth
2175,enableMotor
2176,buildProject
2177,build
2178,writeComment
2179,getRollRad
2180,getYawRad
2181,assertEqualsAndHash
2182,setSeed
2183,setClosestHitFraction
2184,swigDirectorDisconnect
2185,last
2186,getEmissionMode
2187,generateMethodStub
2188,getAction
2189,getMotorTorque
2190,setResizeCheckDelay
2191,setRunnable
2192,newHighValue
2193,addActor
2194,getMouseWheelX
2195,parse
2196,setupFadeScrollBars
2197,setFadeScrollBars
2198,getScrollPane
2199,performanceTest
2200,testValueMatchesIndex
2201,setToggle
2202,getAttributeLocation
2203,setUniform1fv
2204,setNodeIndices
2205,setAngularStiffness
2206,setLinearStiffness
2207,BaryCoord
2208,Diagonal
2209,instance
2210,setPrimitiveSpawnShape
2211,setC0
2212,genCube
2213,onTemplateChecked
2214,setSecondWidget
2215,getShader
2216,spawnShapeToString
2217,getOffsetX
2218,setDebugTableUnderMouse
2219,getDouble
2220,showCursor
2221,getSelection
2222,getTextY
2223,setFocusTraversal
2224,setProgrammaticChangeEvents
2225,getHeightRatio
2226,getRotatedPackedHeight
2227,loadFromFile
2228,split
2229,loadMap
2230,getRepeatValue
2231,getUsedIdsBucket
2232,processInputDir
2233,setFlipHorizontally
2234,getNumRows
2235,hide
2236,updateChildren
2237,getDeclaredFields
2238,getYOffset
2239,setPaddingRight
2240,negate
2241,dst
2242,hasSameDirection
2243,limit2
2244,renderVectorAt
2245,getSpace
2246,setScreenPosition
2247,getViewports
2248,getReferenceAngle
2249,uniformMatrix4fv
2250,getContactCount
2251,isWarmStarting
2252,setContactFilter
2253,getChildrenByName
2254,getZipFile
2255,createRight
2256,setParticleColorBuffer
2257,getOverlappingPairUserCallback
2258,setBox2
2259,getAlgorithm
2260,setActivationState1
2261,setCollisionFlags
2262,setCollisionShape
2263,setContactProcessingThreshold
2264,setDeactivationTime
2265,getCcdSquareMotionThreshold
2266,internalGetExtensionPointer
2267,mergesSimulationIslands
2268,isConvex2d
2269,internalAddChildShape
2270,setUpIndex
2271,addInstance
2272,getSingleAxisRollingFrictionThreshold
2273,setGlobalCfm
2274,getUnscaledPointsFloatPtr
2275,getLocalCenter
2276,clearCache
2277,getHalfExtentsWithMargin
2278,FromCE
2279,getReleasepaircache
2280,getStageCurrent
2281,getChild0
2282,getChilds
2283,getLeaf
2284,enumLeaves
2285,getLkhd
2286,getStartWorldTrans
2287,setCenterOfMassOffset
2288,copyBackToSoftBodies
2289,getStepCount
2290,rayTest
2291,getTransformB
2292,setConvexConservativeDistanceThreshold
2293,setUseEpa
2294,allocateCollisionAlgorithm
2295,getNewManifold
2296,getGravity
2297,removeRigidBody
2298,getSz
2299,List
2300,getGimpactSubType
2301,setIndexbase
2302,getBulletTriangle
2303,hasBoxSet
2304,getId
2305,getLinearUpperLimit
2306,getRbAFrame
2307,getLocalBox
2308,getRotationalLimitMotor
2309,isLimited
2310,getLinearBounce
2311,getLinearMotorCFM
2312,setAngularSpringDampingLimited
2313,setAngularSpringStiffness
2314,setAngularStopERP
2315,setLinearEnableSpring
2316,setLinearEquilibriumPoint
2317,setLinearStopERP
2318,setRbAFrame
2319,getCalculatedTransformA
2320,setSpringEnabled
2321,getLinearServoTarget
2322,getWitnesses
2323,getAngularOnly
2324,getActiveObject
2325,get1MinvJt
2326,getAdiag
2327,getAppliedImpulseLateral2
2328,getNormalWorldOnB
2329,setCombinedRollingFriction
2330,setLocalPointA
2331,getTransformA
2332,getTypeConstraintData
2333,getSphereCount
2334,setAppliedImpulseLateral1
2335,getNumContacts
2336,getMargin
2337,getNumSubtreeHeaders
2338,setBvhQuantization
2339,reportAabbOverlappingNodex
2340,getForwardAxis
2341,resetSuspension
2342,setAdditionalLinearDampingThresholdSqr
2343,getAngularVelocity
2344,applyCentralImpulse
2345,getAdditionalDampingFactor
2346,getStartWorldTransform
2347,setI
2348,setInvInertiaDiagLocal
2349,setLinearDamping
2350,setLocalInertia
2351,getStopCFM
2352,setServoTarget
2353,resizeNoInitialize
2354,getLinearLowerLimit
2355,getCalculatedTransformB
2356,getTargetLinMotorVelocity
2357,getPose
2358,setTetrahedra
2359,solveConstraints
2360,getAabbMax
2361,cutLink
2362,getIsdt
2363,getKLF
2364,getKSKHR
2365,getKSS
2366,getNodes
2367,setAeromodel
2368,setIndex
2369,setKSHR
2370,setMassmatrix
2371,setTag
2372,updateConstants
2373,velocity
2374,setErp
2375,getRadmrg
2376,setKSRHR
2377,setExternalForceImpulse
2378,setLinearVelocity
2379,getRelpos1CrossNormal
2380,setContactNormal2
2381,getOverlapFilterCallback
2382,setNprobes
2383,endBlock
2384,setMeshPartsPtr
2385,getOrigin
2386,getConvexShapeFrom
2387,getTriangleToWorld
2388,internalAddIndexedMesh
2389,Hash
2390,getLockedVertexIndexBase
2391,getConvexEpsilon
2392,getTriangle
2393,setTriangleIndex
2394,setVertex1
2395,getRbB
2396,getObjectType
2397,getUserConstraintType
2398,setFps
2399,setNumIterations
2400,find
2401,closestAxis
2402,serializeFloat
2403,getNormalStride
2404,getVertexStride
2405,setNeedsUpdate
2406,setSuspensionRestLength
2407,getSteering
2408,setJ1angularAxis
2409,getSuspensionRelativeVelocity
2410,getSuspensionRestLength1
2411,setEqualVertexThreshold
2412,minDot
2413,setWheelsSuspensionForce
2414,createMeshInterface
2415,createPoint2PointConstraint
2416,getRigidBodyByName
2417,fadeOut
2418,analyze
2419,sizeBy
2420,getDebug
2421,getOriginX
2422,setParent
2423,checkEqual
2424,getSliderY
2425,sibling
2426,onActivityResult
2427,glBindTransformFeedback
2428,glClearBufferfv
2429,glGetSamplerParameterfv
2430,cancelVibrate
2431,getSurfaceHolder
2432,onKey
2433,setPan
2434,putString
2435,getValueAt
2436,getLoadedAssets
2437,finishLoading
2438,getAssetFileName
2439,getLoader
2440,setErrorListener
2441,taskFailed
2442,setBottomHeight
2443,getPointCameras
2444,getBaselineShift
2445,addToCache
2446,getImagePath
2447,getWrapIndex
2448,setAllowSleep
2449,getWorld
2450,getCenter
2451,getCenterY
2452,getCorner110
2453,setDrawVelocities
2454,setGlyphRegion
2455,createPhysicsWorld
2456,renderBox
2457,resetCapacity
2458,getShapeParts
2459,getAllChecked
2460,orderImpl
2461,getGroupShader
2462,getComputedPadBottom
2463,spaceTop
2464,setPrevVertex
2465,getDeclaredAnnotations
2466,createLoop
2467,invalidateTapSquare
2468,getMe
2469,getRayToWorld
2470,getConvexToWorld
2471,getWrapper
2472,floatToIntBits
2473,getBodyArea
2474,constrainEdges
2475,storeImpulses
2476,getPadY
2477,setV
2478,getCollisionFilterGroup
2479,clearAllCubemaps
2480,writeChars
2481,getSrcBlendFactor
2482,finish
2483,getLocalAnchorA
2484,setObject
2485,getStageTouchDownX
2486,createProxy
2487,getAreaRatio
2488,validateMetrics
2489,velocitySelected
2490,drawAdjustedUV
2491,InternalTickCallback
2492,decodeImage
2493,setHasVertex0
2494,createDefaultEmitter
2495,createDefaultTemplateController
2496,colorValue
2497,GetPrice
2498,EncodeDirectBits
2499,hasExtension
2500,setComparator
2501,disposePixmap
2502,setFlattenOutput
2503,canWrite
2504,endPass1
2505,getMapQuantity
2506,setFilterData
2507,setDrawXYPlane
2508,list
2509,bindSide
2510,getLinearVertAdvance
2511,pointInFrustum
2512,glGetShaderiv
2513,glGetUniformuiv
2514,requestExitAndWait
2515,glDrawElementsInstanced
2516,setGLWrapper
2517,surfaceCreated
2518,tryAcquireEglContextLocked
2519,fireGamepadDisconnected
2520,drawRect
2521,getPercentage
2522,setOrgIndex
2523,computeTransform
2524,glDepthFunc
2525,glGetFloatv
2526,glBlendFuncSeparate
2527,glGenFramebuffer
2528,glLinkProgram
2529,glUniform3i
2530,glVertexAttrib2f
2531,toObject
2532,getApplicationListener
2533,isButtonPressed
2534,external
2535,getFontName
2536,preferredLayoutSize
2537,saveBm
2538,getStatusCode
2539,getMNormalEpsilon
2540,setMMaxFaces
2541,getVertexIndexMapping
2542,getMNumOutputVertices
2543,getMPolygons
2544,setMNumFaces
2545,getCandidateLocales
2546,getFileHandle
2547,getLocalStoragePath
2548,setupCompass
2549,setupPeripherals
2550,shouldChangeCharacters
2551,sendHttpRequest
2552,updateImage
2553,createVertexShader
2554,setStageX
2555,setProcessors
2556,setProcessor
2557,handleEvent
2558,attach
2559,intersectRayBoundsFast
2560,getClassName
2561,isPrimitiveArray
2562,getCallbacks
2563,getContents
2564,glCullFace
2565,glFramebufferTexture2D
2566,glUniform1iv
2567,solveTOI
2568,parseCMethod
2569,asByte
2570,getChild
2571,hasChild
2572,isNumber
2573,btAngle
2574,btGetVersion
2575,btRadians
2576,btSwapEndianDouble
2577,btTan
2578,dot
2579,setHitCollisionObject
2580,absolute
2581,getLwjglCanvas
2582,glGetBooleanv
2583,glEndQuery
2584,glGetActiveUniformBlockiv
2585,glVertexAttribIPointer
2586,mainLoop
2587,mulToOut
2588,lerpAngleDegCrossingZeroBackwards
2589,getTranslation
2590,setVertexTransformationEnabled
2591,setNor
2592,invalidateAllMeshes
2593,getResult
2594,cylinder
2595,setAutoBind
2596,tic
2597,isTouched
2598,loadModelData
2599,extendBoundingBox
2600,loadMeshes
2601,getFrequency
2602,setAlignment
2603,emitMethodBody
2604,getRenderables
2605,emitJavaMethod
2606,failed
2607,getContentLength
2608,setFollowRedirects
2609,getValue
2610,getTotalWidth
2611,calculateWorldTransform
2612,floatToIntColor
2613,getControlCount
2614,getRate
2615,getSpriteCache
2616,getMFaceCount
2617,setMIndexCount
2618,resumeSourcesWithBuffer
2619,setCapacity
2620,getPercentComplete
2621,changed
2622,readPCM
2623,setupUI
2624,getTransform
2625,getCriticalPressure
2626,loadAsync
2627,getDuplicateBorder
2628,setPageWidth
2629,setScale
2630,calculateLength
2631,updateTextureAtlas
2632,accum
2633,endAccum
2634,getGroundAnchorA
2635,getAngleRad
2636,getYaw
2637,getTest
2638,nextDouble
2639,putDouble
2640,getSize
2641,decRefCount
2642,onRegionsSelected
2643,setRefCount
2644,computeCentroidToOut
2645,setBlending
2646,setMaxMotorTorque
2647,getCos
2648,getScrollWidth
2649,getVelocityX
2650,isPanning
2651,setOverscroll
2652,getRequired
2653,mixRestitution
2654,getLog
2655,getOpacity
2656,setBlurPasses
2657,createTypeInvokables
2658,newDrawable
2659,getDrawable
2660,getLdamping
2661,getMasses
2662,setClusterIndex
2663,setDimpulses
2664,setVimpulses
2665,getSoftKineticClusterImpulseSplit
2666,getVelocityIterations
2667,setLift
2668,setPositionIterations
2669,setSoftKineticClusterImpulseSplit
2670,setSoftSoftClusterHardness
